import random

liushisigua = {
    0b000000: ('䷁', '坤为地'),
    0b000001: ('䷖', '山地剥'),
    0b000010: ('䷇', '水地比'),
    0b000011: ('䷓', '风地观'),
    0b000100: ('䷏', '雷地豫'),
    0b000101: ('䷢', '火地晋'),
    0b000110: ('䷬', '泽地萃'),
    0b000111: ('䷋', '天地否'),
    0b001000: ('䷎', '地山谦'),
    0b001001: ('䷳', '艮为山'),
    0b001010: ('䷦', '水山蹇'),
    0b001011: ('䷴', '风山渐'),
    0b001100: ('䷽', '雷山小过'),
    0b001101: ('䷷', '火山旅'),
    0b001110: ('䷞', '泽山咸'),
    0b001111: ('䷠', '天山遁'),
    0b010000: ('䷆', '地水师'),
    0b010001: ('䷃', '山水蒙'),
    0b010010: ('䷜', '坎为水'),
    0b010011: ('䷺', '风水涣'),
    0b010100: ('䷧', '雷水解'),
    0b010101: ('䷿', '火水未济'),
    0b010110: ('䷮', '泽水困'),
    0b010111: ('䷅', '天水讼'),
    0b011000: ('䷭', '地风升'),
    0b011001: ('䷑', '山风蛊'),
    0b011010: ('䷯', '水风井'),
    0b011011: ('䷸', '巽为风'),
    0b011100: ('䷟', '雷风恒'),
    0b011101: ('䷱', '火风鼎'),
    0b011110: ('䷛', '泽风大过'),
    0b011111: ('䷫', '天风姤'),
    0b100000: ('䷗', '地雷复'),
    0b100001: ('䷨', '山雷颐'),
    0b100010: ('䷂', '水雷屯'),
    0b100011: ('䷩', '风雷益'),
    0b100100: ('', '震为雷'),
    0b100101: ('', '火雷噬嗑'),
    0b100110: ('', '泽雷随'),
    0b100111: ('', '天雷无妄'),
    0b101000: ('', '地火明夷'),
    0b101001: ('', '山火贲'),
    0b101010: ('', '水火既济'),
    0b101011: ('', '风火家人'),
    0b101100: ('', '雷火丰'),
    0b101101: ('', '离为火'),
    0b101110: ('', '泽火革'),
    0b101111: ('', '天火同人'),
    0b110000: ('', '地泽临'),
    0b110001: ('', '山泽损'),
    0b110010: ('䷄', '水泽节'),
    0b110011: ('', '风泽中孚'),
    0b110100: ('', '雷泽归妹'),
    0b110101: ('', '火泽睽'),
    0b110110: ('', '兑为泽'),
    0b110111: ('', '天泽履'),
    0b111000: ('', '地天泰'),
    0b111001: ('', '山天大畜'),
    0b111010: ('', '水天需'),
    0b111011: ('', '风天小畜'),
    0b111100: ('', '雷天大壮'),
    0b111101: ('', '火天大有'),
    0b111110: ('', '泽天夬'),
    0b111111: ('䷀', '乾为天'),

}

# 八卦取象歌：
#
# 乾三连 坤六断 震仰盂 艮覆碗
#
# 离中虚 坎中满 兑上缺 巽下断

# https://zh-yue.wikipedia.org/wiki/%E5%85%AD%E5%8D%81%E5%9B%9B%E5%8D%A6

# 					䷅	䷆	䷇	䷈	䷉	䷊	䷋	䷌	䷍	䷎	䷏
# U+4DDx	䷐	䷑	䷒	䷓	䷔	䷕	䷖	䷗	䷘	䷙	䷚	䷛	䷜	䷝	䷞	䷟
# U+4DEx	䷠	䷡	䷢	䷣	䷤	䷥	䷦	䷧	䷨		䷪	䷫	䷬	䷭	䷮	䷯
# U+4DFx	䷰	䷱	䷲	䷳	䷴	䷵	䷶	䷷	䷸	䷹	䷺	䷻	䷼	䷽	䷾	䷿


def qigua():
    a = random.randint(0, 1)
    b = random.randint(0, 1)
    c = random.randint(0, 1)
    total = a + b + c
    print(f"{a} {b} {c}")
    if total == 0:
        # 三个反面是老阳，主卦为阳，变卦为阴
        return "o"
    elif total == 1:
        # 一个正面为少阴
        return "⚋"
    elif total == 2:
        # 两个正面为少阳
        return "⚊"
    elif total == 3:
        # 三个正面是老阴， 主卦为阴， 变卦为阳
        return "x"


# Press the green button in the gutter to run the script.
if __name__ == '__main__':
    gua = ['', '', '', '', '', '']
    bengua = ['', '', '', '', '', '']
    biangua = ['', '', '', '', '', '']
    for i in range(6):
        y = qigua()
        gua[i] = y
        if y == '⚋' or y == '⚊':
            bengua[i] = y
            biangua[i] = y
        elif y == 'o':
            bengua[i] = '⚊'
            biangua[i] = '⚋'
        elif y == 'x':
            bengua[i] = '⚋'
            biangua[i] = '⚊'

    y2i = {'⚋': '0', '⚊': '1'}

    print(gua)
    print(bengua)
    bengua_idx = int(''.join([y2i[y] for y in bengua]), 2)
    if bengua_idx in liushisigua:
        print(liushisigua[bengua_idx])
    print(biangua)
    biangua_idx = int(''.join([y2i[y] for y in biangua]), 2)
    if biangua_idx in liushisigua:
        print(liushisigua[biangua_idx])
